{"basics":{"name":"Pablo Diego Pereira","label":"Economics | Data Analyst | Data Scientist","image":"prof_pic.jpg","email":"pablodiegoo@gmail.com","phone":"(21)979381580","url":"https://pablodiegoo.github.io/","summary":"Economist with a strong analytical focus, specializing in data-driven decisions and Customer Experience (CX). Expert in automating data collection (NPS, CSAT) and performing mixed-methods analysis—combining quantitative rigor (Python/SQL) with qualitative depth.","location":{"address":"","postalCode":"","city":"Araruama","countryCode":"BR","region":"Rio de Janeiro"},"profiles":[{"network":"Twitter","username":"pablodiegoo","url":"https://twitter.com/pablodiegoo"},{"network":"Github","username":"pablodiegoo","url":"https://github.io/pablodiegoo"},{"network":"LinkedIn","username":"pablodiegoo","url":"https://www.linkedin.com/in/pablodiegoo/"}]},"work":[{"name":"NKIN Consultoria (Agora Pesquisa)","position":"Data & Insights Analyst","url":"https://agorapesquisa.com.br","startDate":"2025-04-28","endDate":"Today","summary":"Hands-on role focused on transforming raw data into strategic intelligence by combining automated collection and hybrid analysis.","highlights":["Implemented conversational flows and automated collection of CX metrics (NPS, CSAT) via Meta API (WhatsApp), reducing manual effort by 90% and increasing operational productivity by 3,500%.","Optimized research workflows to achieve a 65% increase in operational margin, managing a minimal cost trade-off to scale efficiency.","Performed robust quantitative analysis using Python and SQL, alongside qualitative studies to extract deep consumer insights and satisfaction indicators.","Developed data pipelines to integrate collection tools with structured databases for real-time reporting on customer experience.","Delivered strategic analytical reports for public and private sectors, applying market research and CX methodologies."]},{"name":"Meta Investimentos","position":"Investment Advisor","url":"https://invistameta.com.br","startDate":"2020-06-01","endDate":"Today","summary":"Investment Advisor for over 5 years, offering expert guidance and personalized financial strategies to clients, solidifying my expertise in the financial market.","highlights":["Provide investment advice to clients, creating and maintaining assessments to identify risk profiles, financial planning flaws and potential client needs.","Create portfolio analysis graphs and reports using financial market data, identifying potential opportunities for portfolio optimization.","Leveraged data analysis, market research, and critical thinking to translate complex data into actionable financial insights for client planning.","Developed and presented concise reports and portfolio analyses using data visualization tools (Excel, Google Sheets, Looker, Power BI).","Financial modeling, using historical data series and quantitative methods to project potential performance risks.","Monitored market trends and assessed investment risks to inform portfolio adjustments and ensure regulatory compliance.","Provided expert guidance on diverse investment products and strategies tailored to individual client needs."]},{"name":"Meta&Actio Investimentos","position":"Back-office Manager & Investment Advisor","startDate":"2017-08-01","endDate":"2020-05-01","summary":"Started as the sole back-office operator and grew into a leadership role, managing operations, implementing key financial tools, and leading a team. Focused on analytical thinking, process management, portfolio building, and investment planning.","highlights":["Developed standardized personal financial planning spreadsheets and forms for advisors, reducing service time, boosting operational efficiency, identifying >20% tax savings opportunities for clients (avoiding 'come-cotas'), and driving >100% expansion in insurance sales.","Spearheaded the implementation of pair trading (long & short) operations, creating an R algorithm identifying >100 monthly arbitrage opportunities and establishing a new revenue stream.","Managed and streamlined back-office operations from the ground up, significantly improving workflow efficiency and accuracy.","Trained and led a growing back-office team, fostering a collaborative and high-performing environment as the department expanded.","Implemented process improvements and automation initiatives to optimize operational performance and minimize errors.","Ensured adherence to financial regulations and internal policies within all back-office procedures."]},{"name":"Espaço Champs Elysees","position":"Co-Founder","startDate":"2014-01-01","endDate":"2018-11-01","summary":"As the sole owner and operator ('one-man company') of Espaço Champs Elysees, I managed all aspects of the business, from online presence and marketing to operations, supplier negotiations, and event execution, focusing on customer satisfaction and operational efficiency.","highlights":["Established and managed the complete online presence (Website, Social Media), achieving #1 ranking in regional organic search results.","Negotiated and drafted contracts with local suppliers for events, parties, and spa services, achieving a 70% reduction in payroll expenses through strategic outsourcing.","Designed and implemented automated sales and marketing workflows, resulting in an 80% faster response time and a 30% increase in conversion rates.","Executed operational optimizations that doubled kitchen service capacity and expanded spa service capacity by 300%.","Solely managed all business functions including finance, marketing, sales, operations, event planning, and customer service as a 'one-man company'.","Developed and executed successful marketing campaigns across digital and traditional channels to drive bookings and brand awareness.","Oversaw all financial aspects, including budgeting, invoicing, and expense management."]},{"name":"BX House","position":"Digital Marketing Consultant","startDate":"2002-11-01","endDate":"2014-01-01","summary":"Digital Marketing Consultant for Rio de Janeiro and region.","highlights":[]},{"name":"Institute of Economics at Federal University of Rio de Janeiro","position":"Intern Research Assistant at Economics Innovation Group","startDate":"2011-06-01","endDate":"2012-01-01","summary":"Supported an international research project on Brazil's ICT sector, focusing on factors influencing new business creation. Contributed to data management and analysis, highlighting entrepreneurial traits and sector challenges.","highlights":["Provided research support for an international project analyzing Brazil's Technology, Information, and Communication (ICT) sector.","Utilized Google Sheets, Google Forms, and Google Docs for data collection, management, and documentation related to the research.","Contributed to analyzing factors influencing new ICT business creation, including entrepreneurial traits, socio-cultural context, and access to information.","Assisted in identifying key challenges within the sector, such as funding access, internationalization, and government support, based on survey data.","Applied analytical skills to support the comprehensive analysis of the sector's dynamics."]}],"volunteer":[{"institution":"AIESEC - Association Internationale des Étudiants en Sciences Économiques et Commerciales","location":"RJ, Brazil","position":"Marketing and Communications Associate","url":"https://aiesec.org.br/","startDate":"2010-05-01","endDate":"2012-02-01","summary":"Contributed to marketing and communications for AIESEC, implementing cloud-based tools (Google Suite) for improved data gathering and outreach within the global youth organization.","highlights":["Actively contributed to marketing and communications initiatives for AIESEC over nearly two years.","Implemented Google Sheets and Google Docs to streamline document management and collaboration for marketing materials.","Utilized Google Forms to gather insights into the needs and demands of exchange students and members, improving engagement strategies.","Developed skills in outreach and engagement within a global youth organization context.","Supported communication campaigns aimed at promoting AIESEC programs and activities."]},{"institution":"Ayra Consultoria","location":"RJ, Brazil","url":"https://www.ayraconsultoria.com.br/","position":"Marketing and Communications Consultant","startDate":"2012-01-01","endDate":"2012-08-01","summary":"Served as a Marketing and Communications Consultant, contributing to various projects, including the development of the company's own marketing plan, and gaining problem-solving experience.","highlights":["Provided marketing and communications consultancy for Ayra Consultoria over a 9-month period.","Played a key role in developing the company's internal marketing plan.","Participated in various client projects, enhancing problem-solving skills.","Utilized tools like Google Analytics for tracking and reporting on marketing performance.","Managed social media presence and content creation.","Leveraged Google Suite (Sheets, Docs, Forms) for project documentation and data management.","Applied design skills using Corel Draw and Adobe Photoshop for marketing materials.","Gained experience with WordPress for website content management."]}],"education":[{"institution":"University of São Paulo - Luiz de Queiroz College of Agriculture","location":"SP, Brazil","url":"https://www.esalq.usp.br/","area":"Data Science and Analytics","studyType":"Master of Business Administration","startDate":"2024-10-01","endDate":"Present","score":"","courses":["Data Science","Machine Learning","Artificial Intelligence","Data Visualization","Blockchain","Cryptocurrency","Deep Learning"]},{"institution":"Institute of Economics at Federal University of Rio de Janeiro","location":"RJ, Brazil","url":"https://www.ie.ufrj.br/","area":"Economics","studyType":"Barchelor","startDate":"2010-01-01","endDate":"2014-01-01","score":"","courses":["Analytical Skills","Economics Inovation","Investments","Data Analysis","Macronomics","Microeconomics","Mathematics","Statistics","R","Microsoft Excel"]}],"awards":[{"title":"","date":"","awarder":"","url":"","summary":""}],"certificates":[{"name":"Data Analysos with Python","date":"2025-02-25","issuer":"Free Code Camp","url":"","icon":"fa fa-tag","summary":""},{"name":"Create Image Captioning Models with Google Cloud","date":"2024-01-01","issuer":"Google Cloud","url":"","icon":"fa fa-tag","summary":""},{"name":"Data Analyst Associate","date":"2024-01-01","issuer":"DataCamp","url":"","icon":"fa fa-tag","summary":""},{"name":"Google Data Analytics","date":"2025-02-25","issuer":"Google","url":"https://www.coursera.org/account/accomplishments/professional-cert/","icon":"fa fa-tag","summary":"Completed comprehensive Google Data Analytics Professional Certificate covering data analysis, visualization, R programming, and SQL."},{"name":"Investment Portfolio Analysis with R","date":"2025-02-22","issuer":"Udemy","url":"https://www.udemy.com/certificate/","icon":"fa fa-tag","summary":"Mastered portfolio analysis techniques using R, including risk assessment, return calculation, and optimization strategies."},{"name":"Investments Risk Management","date":"2025-02-18","issuer":"Google","url":"https://www.coursera.org/account/accomplishments/verify/","icon":"fa fa-tag","summary":"Advanced course on investment risk management, covering portfolio theory, risk metrics, and mitigation strategies."},{"name":"Compare Stock Returns with Google Sheets","date":"2025-02-17","issuer":"Coursera","url":"https://www.coursera.org/account/accomplishments/verify/","icon":"fa fa-tag","summary":"Learned advanced techniques for stock return analysis and comparison using Google Sheets."},{"name":"Dynamic Reports with R Markdown","date":"2025-02-11","issuer":"Udemy","url":"https://www.udemy.com/certificate/","icon":"fa fa-tag","summary":"Mastered creation of elegant and structured dynamic reports using R Markdown for data analysis presentation."},{"name":"Data Analysis with R Programming","date":"2025-02-03","issuer":"Google","url":"https://www.coursera.org/account/accomplishments/verify/6VUL3H7I41LG","icon":"fa fa-tag","summary":"Comprehensive course on data analysis using R, covering data manipulation, visualization, and statistical analysis."},{"name":"Transformer Models and BERT","date":"2023-11-21","issuer":"Udacity","url":"https://graduation.udacity.com/confirm/","icon":"fa fa-tag","summary":"Deep dive into transformer architecture and BERT models for natural language processing with Google Cloud."},{"name":"Encoder-Decoder Architecture","date":"2023-11-21","issuer":"Udacity","url":"https://graduation.udacity.com/confirm/","icon":"fa fa-tag","summary":"Advanced study of encoder-decoder architectures in machine learning using Google Cloud Platform."},{"name":"Introduction to Large Language Models","date":"2023-10-27","issuer":"Udacity","url":"https://graduation.udacity.com/confirm/","icon":"fa fa-tag","summary":"Comprehensive introduction to LLMs, their architecture, and applications using Google Cloud."},{"name":"Introduction to Generative AI","date":"2023-10-27","issuer":"Udacity","url":"https://graduation.udacity.com/confirm/","icon":"fa fa-tag","summary":"Explored fundamentals of generative AI and its applications using Google Cloud Platform."},{"name":"Share Data Through the Art of Visualization","date":"2025-02-07","issuer":"Google","url":"https://www.coursera.org/account/accomplishments/verify/0X7KSS3FZVX1","icon":"fa fa-tag","summary":"Completed the course 'Share Data Through the Art of Visualization' on Coursera."},{"name":"Analyze Data to Answer Questions","date":"2025-02-07","issuer":"Google","url":"https://www.coursera.org/account/accomplishments/verify/9530R10UTO12","icon":"fa fa-tag","summary":"Completed the course 'Analyze Data to Answer Questions' on Coursera."},{"name":"Formação Perito Judicial","date":"2025-01-29","issuer":"Academia do Perito","url":"https://academiadoperito.com.br/pdf_data/MzcxRURGMUUwNEIyRTc4QkJCRTlBNkZFQUVBNDk5MkJwYWJsb2RpZWdvb0BnbWFpbC5jb20=.pdf","icon":"fa fa-tag","summary":"Completed the course 'Formação Perito Judicial' on Academia do Perito."},{"name":"Prepare Data for Exploration","date":"2024-12-04","issuer":"Google","url":"https://www.coursera.org/account/accomplishments/verify/RJIVHXRPMZFG","icon":"fa fa-tag","summary":"Completed the course 'Prepare for data Exploration' on Coursera."},{"name":"Data Visualization","date":"2023-10-17","issuer":"Free Code Camp","url":"https://www.freecodecamp.org/certification/fcc21bdd3b0-017c-4bcd-ac26-8f8191da73a8/data-visualization","icon":"fa fa-tag","summary":"Completed the course 'Data Visualization' on Free Code Camp."},{"name":"EF SET English Certificate (C2 Proficient)","date":"2023-07-01","issuer":"EF Standard English Test (EF SET)","url":"https://www.efset.org/cert/sqaB64","icon":"fa fa-tag","summary":"Achieved a C2 Proficient level in the EF Standard English Test (EF SET) with a score of 79/100."},{"name":"Ask Questions to Make Data-Driven Decisions","date":"2023-06-13","issuer":"Google","url":"https://www.coursera.org/account/accomplishments/verify/RTXF3YGZCF6D","icon":"fa fa-tag","summary":"Completed the course 'Ask Questions to Make Data-Driven Decisions' on Coursera."},{"name":"Foundations: Data, Data, Everywhere","date":"2023-05-01","issuer":"Google","url":"https://www.coursera.org/account/accomplishments/verify/RUTN96QWD9HF","icon":"fa fa-tag","summary":"Completed the course 'Foundations: Data, Data, Everywhere' on Coursera, covering analytical skills, Microsoft Excel, MySQL, and data analysis."},{"name":"Crowdfunding","date":"2022-10-01","issuer":"Coursera","url":"https://www.coursera.org/account/accomplishments/verify/9TFWN2X7DBDM","icon":"fa fa-tag","summary":"Completed the course 'Crowdfunding' on Coursera, focusing on investments."},{"name":"FBB100 Correspondente Completo","date":"2020-11-01","issuer":"FEBRABAN","url":"","icon":"fa fa-tag","summary":"Certified as 'FBB100 Correspondente Completo' by FEBRABAN with an expiration date of November 2023."},{"name":"Specialist Advisory","date":"2019-06-01","issuer":"Proseek","url":"","icon":"fa fa-tag","summary":"Earned the 'Specialist Advisory' certification from Proseek, with a focus on investments, Microsoft Excel, and data analysis."},{"name":"Agente Autonomo de Investimentos","date":"2018-02-01","issuer":"ANCORD","url":"http://54.209.169.151/Ancord/forms/home/Documentos/Lista%20de%20Aprovados/2018/Aprovados02.aspx","icon":"fa fa-tag","summary":"Certified as an 'Agente Autonomo de Investimentos' by ANCORD."},{"name":"Bitcoin and Cryptocurrency Technologies","date":"2017-08-01","issuer":"Princeton University","url":"https://www.coursera.org/account/accomplishments/verify","icon":"fa-solid fa-tag","summary":"Completed the course 'Bitcoin and Cryptocurrency Technologies' at Princeton University, with a focus on investments and Microsoft Excel."},{"name":"DCC Certified Professional","date":"2017-05-01","issuer":"Digital Currency Council","url":"https://t.cred.ly/0Gycog5I+ZPL+UmWF7Vc8g==$$$cLeJuoqlXCwHHd6UEAD65zNoDq90/C/yDtA1je15wk2K5/pWa3MwwH3qoK5RXG5piaAlDemhcV1d40PofFLWumEOQB+mi5amDrqWtO3xk4o=?r=https%3A%2F%2Fcredly.com%2Fcredit%2F13946902&t=1494890749&c=lip","icon":"fa fa-tag","summary":"Certified as a 'DCC Certified Professional' by the Digital Currency Council."}],"publications":[{"name":"[PT-BR]Cryptocurrencies: are these viable forms of money?","publisher":"Institute of Economics at Federal University of Rio de Janeiro","releaseDate":"2019-09-24","url":"https://pantheon.ufrj.br/handle/11422/11747","summary":"The present work aims to present an introduction to the study of cryptocurrencies, focusing on Bitcoin, the first cryptocurrency created. The basic concepts of cryptography, the technology behind cryptocurrencies, and the functioning of Bitcoin will be presented. The main challenges faced by Bitcoin and the main criticisms made to it will also be presented."},{"name":"[PT-BR]Cryptocurrencies – Viable Forms Of Money? A Brief Analysis Of The Characteristics And Functions Of Currency Compared To Electronic Currencies","publisher":"[PT-BR]VIII Federal University of Rio de Janeiro Academic Integration Week","releaseDate":"2017-10-24","url":"https://sistemas2.macae.ufrj.br/8siac/arquivo/Caderno_de_resumos_CCJE_2017.pdf","summary":"In recent years, technological advancements have significantly impacted society, exemplified by the proliferation of smartphones and the emergence of electronic currencies, with Bitcoin being the most prominent. These cryptocurrencies, based on encryption, have evolved into financial assets with over a $100 billion market capitalization in just nine years, blurring the lines between traditional currencies and investment instruments."},{"name":"[PT-BR]Entrepreneurial Attitude Paradigms: An Analysis of the Elements that Facilitate the Creation of New ICT Businesses in Brazil","publisher":"[PT-BR]XXXIV Giulio Massarani Journey of Scientific, Artistic and Cultural Initiation - Federal University of Rio de Janeiro","releaseDate":"2012-10-02","url":"https://posgraduacao.ufrj.br/public/suporte/jicac/livroResumo/2012/Humanas.pdf","summary":"In the evolving landscape of the post-Fordist era and the rise of the knowledge society, the Brazilian technology, information, and communication (TIC) sector is witnessing growth opportunities fueled by an expanding middle class and increasing digital inclusion. This study delves into the factors influencing the creation of new businesses within the Brazilian TIC sector, shedding light on the pivotal role of individual entrepreneurial traits, socio-cultural context, and access to information and knowledge, while also revealing challenges in access to funding, internationalization, and government support. With insights from 76 valid responses, this research underscores the significance of individual attributes in the entrepreneurial decision-making process, ultimately presenting a comprehensive analysis of the sector's dynamics."}],"skills":[{"name":"Soft Skills","level":"","icon":"fa fa-hashtag","keywords":"Problem Solving, Analytical Thinking, Communication, Team Work, Adaptability, Conflict Management, Negotiation, Proactivity, Entrepreneurship, Qualitative Analysis, Mixed Methods Research"},{"name":"Financial Skills","level":"","icon":"fa fa-hashtag","keywords":"Investment Advisory, Financial Planning, Financial Expert Witness, Portfolio Analysis, Risk Management, Cryptocurrency"},{"name":"Data Science & Analytics","level":"","icon":"fa fa-hashtag","keywords":"R, Python, SQL, Extract, Transform, Load (ETL), Exploratory Data Analysis, Statistical Data Analysis, Customer Experience (CX), NPS / CSAT / CES, Machine Learning, RAG, LangChain, scikit-learn, ggplot2, Matplotlib, Seaborn, R Markdown"},{"name":"Web & Software Development","level":"","icon":"fa fa-hashtag","keywords":"PHP, JavaScript, HTML, CSS, LaTeX, WordPress, Laravel, D3.js, Meta API (WhatsApp) Automation, Git, R Markdown"},{"reference":"jnkfdjnkfjnsdfj"},{"name":"Tools & Productivity","level":"","icon":"fa fa-hashtag","keywords":"Google Looker, Power BI, Google Sheets, Excel, PowerPoint, Google Analytics, Typebot"}],"languages":[{"language":"Portuguese","fluency":"Native speaker","icon":"fa fa-hashtag"},{"language":"English","fluency":"Fluent","icon":"fa fa-hashtag"}],"interests":[{"name":"Economics","icon":"fa fa-thumbtack","keywords":"Inovation, Entrepreneurship, Startup, Cryptocurrency, Time Series, Economic Development, Economic Policy"},{"name":"Technology","icon":"fa fa-thumbtack","keywords":"Data Science, Machine Learning, Artificial Intelligence, Web3, Blockchain, Web Development, Mobile Development"},{"name":"Sports","icon":"fa fa-thumbtack","keywords":"Football(Soccer), E-Sports"}],"references":[{"name":"","icon":"","reference":""}],"projects":[{"name":"Project Aporia","summary":"Development of an analytical platform for research data management and insight automation.","highlights":["Multi-mode surveys","Survey Automation","Data Architecture","PHP","Laravel","JavaScript","HTML","CSS","Python & SQL","Automated Insights Generation"],"startDate":"2025-06-01"},{"name":"PabloDiegoo Github Page","summary":"Personal Website","highlights":["Data Analysis","AMP HTML","D3.JS","Laravel","PHP","SQL","Web Development","Data Visualization","Web3","Blockchain","Cryptocurrency"],"url":"https://pablodiegoo.github.io/","startDate":"2023-10-10"},{"name":"L96.APP","summary":"Web Application","highlights":["AMP HTML","D3.JS","Google Looker","Laravel","PHP","SQL","Javascript","HTML","CSS","Wordpress","Web Development","Data Visualization","Communication","Data Analysis"],"url":"https://lab.l96.app/","startDate":"2023-05-23"}]}